package cc.dt.hrweb.common.domain;

/**
 * 正则常量
 */
public class RegexpConstant {

    // 简单手机号正则（这里只是简单校验是否为11位，实际规则很复杂）
    public static final String MOBILE_REG = "[1]\\d{10}";

    //验证日期格式YYYY-MM-DD
    public static final String DATE_REG = "(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)$";

}
